src/cf/Catalogs/эвПараметрыЭквайринкогоТерминалаСпасибо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>эвПараметрыЭквайринкогоТерминалаСпасибо</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СпособыОплаты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>networks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>partners</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТерминала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>servicePointExtId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольСертификата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПроцессинга</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>P_DistribPath</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйПроцентОплатыБонусами</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОднаФиктивнаяПозиция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/эвПараметрыЭквайринкогоТерминалаСпасибо/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьАдресФайлаДляСкачивания()

    // Приоритет: только что выбранный на форме файл, затем сохранённый в объекте.
    Если ЭтоАдресВременногоХранилища(АдресФайла) Тогда
        Возврат АдресФайла;
    КонецЕсли;
    
    Если Объект.Ссылка.Пустая() Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    ДанныеФайла = Объект.Ссылка.Сертификат.Получить();
    Если ДанныеФайла = Неопределено Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    Возврат ПоместитьВоВременноеХранилище(ДанныеФайла, УникальныйИдентификатор);

КонецФункции

&НаКлиенте
Процедура ПроверитьДоступКПроцессингу(Команда)
    
    ПараметрыПроверки = Новый Структура;
    ПараметрыПроверки.Вставить("АдресПроцессинга", Объект.АдресПроцессинга);
    ПараметрыПроверки.Вставить("АдресСертификата", ПолучитьАдресФайлаДляСкачивания());
    ПараметрыПроверки.Вставить("ПарольСертификата", Объект.ПарольСертификата);
    ПараметрыПроверки.Вставить("networks", Объект.networks);
    ПараметрыПроверки.Вставить("partners", Объект.partners);
    
    РезультатПроверки = эвСберСпасибоКлиент.ПроверитьДоступКПроцессингу(ПараметрыПроверки);
    ПоказатьСообщениеПользователю(РезультатПроверки.ТекстСообщения);
    
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСообщениеПользователю(ТекстСообщения)
    
    Сообщение = Новый СообщениеПользователю;
    Сообщение.Текст = ТекстСообщения;
    Сообщение.Сообщить();
    
КонецПроцедуры

&НаКлиенте
Процедура СертификатНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

    СтандартнаяОбработка = Ложь;
    
    ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
    ПараметрыДиалога.МножественныйВыбор = Ложь;
    ПараметрыДиалога.Заголовок = НСтр("ru = 'Выберите файл сертификата'; en = 'Select file'");
    ПараметрыДиалога.Фильтр = НСтр("ru = 'Сертификат'; en = 'Cert'") + " (*.pfx)|*.pfx|";
    
    ЗавершениеОбратныйВызов = Новый ОписаниеОповещения("ПослеЗакрытияВыбораСертификата", ЭтотОбъект);
    НачатьПомещениеФайлаНаСервер(ЗавершениеОбратныйВызов,,,, ПараметрыДиалога, ЭтаФорма.УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВыбораСертификата(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт

    Если ОписаниеПомещенногоФайла = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    АдресФайла = ОписаниеПомещенногоФайла.Адрес;
    Объект.Наименование = ОписаниеПомещенногоФайла.СсылкаНаФайл.Имя;
    
    УстановитьВидомостьКартинки(Истина);
    
    Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

    Если ЭтоАдресВременногоХранилища(АдресФайла) Тогда
        ТекущийОбъект.Сертификат = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресФайла));
        УстановитьВидомостьКартинки(Истина);
    КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если Объект.Ссылка.Пустая() Тогда
        УстановитьВидомостьКартинки(Ложь);
    ИначеЕсли Объект.Ссылка.Сертификат.Получить() = Неопределено Тогда  
        УстановитьВидомостьКартинки(Ложь);
    Иначе
        УстановитьВидомостьКартинки(Истина);
    КонецЕсли;
    
    РежимРаботыДоИзменения = Объект.РежимРаботы;
    
КонецПроцедуры

&НаСервере
Процедура УстановитьВидомостьКартинки(В)

    Элементы.Картинка.Видимость = В;

КонецПроцедуры

&НаКлиенте
Процедура P_DistribPathНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
    
    СтандартнаяОбработка = ЛОЖЬ;
    
    Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
    ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
    ДиалогОткрытия.Каталог = Объект.P_DistribPath;  
    ДиалогОткрытия.Заголовок = "Выберите каталог sb_pilot"; 
        
    Параметр = "";
    Оповещение = Новый ОписаниеОповещения("ВыборКаталога_Завершение", ЭтотОбъект, Параметр );
    ДиалогОткрытия.Показать(Оповещение);
    
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталога_Завершение(Результат, Параметр) Экспорт
    
    Если Результат = Неопределено Тогда
        Сообщить("Каталог не выбран");
         Возврат;
     КонецЕсли; 
     
    Объект.P_DistribPath = Результат[0];  
    
КонецПроцедуры

	
&НаКлиенте
Процедура РежимРаботыПриИзменении(Элемент)
    
    Если Объект.РежимРаботы = 0 Тогда
        РежимРаботыДоИзменения = Объект.РежимРаботы;
        Возврат;
    КонецЕсли;
    
    Оповещение = Новый ОписаниеОповещения("РежимРаботыПриИзмененииЗавершение", ЭтотОбъект);
    ТекстВопроса = НСтр("ru = 'Данные PartnerId, ServicePointExtId и Terminal будут перезаполнены. Продолжить?'");
    ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
    
КонецПроцедуры

&НаКлиенте
Процедура РежимРаботыПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
        Объект.РежимРаботы = РежимРаботыДоИзменения;
        Возврат;
    КонецЕсли;
    
    Если Объект.РежимРаботы = 1 Тогда
        Объект. partners= "11802504";
        Объект.servicePointExtId = "to_purchase";
        Объект.НомерТерминала = "term_purchase";
    ИначеЕсли Объект.РежимРаботы = 2 Тогда
        Объект. partners= "11802509";
        Объект.servicePointExtId = "to_bonusSpend";
        Объект.НомерТерминала = "term_bonusSpend";
    ИначеЕсли Объект.РежимРаботы = 3 Тогда
        Объект. partners= "11802514";
        Объект.servicePointExtId = "to_confirmation";
        Объект.НомерТерминала = "term_confirmation";
    КонецЕсли;
    
    РежимРаботыДоИзменения = Объект.РежимРаботы;
    
КонецПроцедуры
